# -*- mode: ruby -*-
# vi: set ft=ruby :

brew 'bazel'
brew 'buildifier'
brew 'exa'
brew 'git'
brew 'htop'
brew 'llvm'
brew 'node'
brew 'python'
brew 'python@2'
brew 'the_silver_searcher'
brew 'w3m'
brew 'wget'
brew 'zplug'
brew 'zsh'
brew 'zsh-syntax-highlighting'

cask 'xquartz'

cask 'dash'
cask 'docker'
cask 'emacs'
cask 'google-chrome'
cask 'gureumkim'
cask 'iterm2'
cask 'moom'
cask 'omnigraffle'
cask 'papers'
cask 'quicksilver'
cask 'skim'
cask 'slack'
cask 'sync'
cask 'the-unarchiver'
cask 'x2goclient'

cask 'mactex'
