# -*- mode: ruby -*-
# vi: set ft=ruby :

brew 'aspell'
brew 'bazel'
brew 'bibtex2html'
brew 'buildifier'
brew 'git'
brew 'gnupg'
brew 'htop'
brew 'llvm'
brew 'mas'
brew 'multimarkdown'
brew 'node'
brew 'pwgen'
brew 'python'
brew 'python@2'
brew 'tree'
brew 'w3m'
brew 'wget'
brew 'zplug'
brew 'zsh'

brew 'https://raw.githubusercontent.com/junegunn/blsd/master/blsd.rb', args: ["HEAD"]

cask 'xquartz'

cask 'dash'
cask 'docker'
cask 'google-chrome'
cask 'gureumkim'
cask 'iterm2'
cask 'moom'
cask 'omnigraffle'
cask 'papers'
cask 'quicksilver'
cask 'skim'
cask 'slack'
cask 'sync'
cask 'the-unarchiver'
cask 'x2goclient'

cask 'mactex'

tap 'homebrew/cask-fonts'
cask 'font-office-code-pro'

tap 'd12frosted/emacs-plus'
brew 'emacs-plus'

mas 'KakaoTalk', id: 869223134 unless File.exist? '/Applications/KakaoTalk.app'
mas 'Moom', id: 419330170 unless File.exist? '/Applications/Moom.app'
mas 'Xcode', id: 497799835 unless File.exist? '/Applications/Xcode.app'
